results_mongo_5/workloada_5nodes_load_7.txt
java -cp /mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/conf:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/conf:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/core-0.17.0.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P ../workloads/workloada -P mongodb.properties -load
Command line: -db site.ycsb.db.MongoDbClient -s -P ../workloads/workloada -P mongodb.properties -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2025-11-22 16:36:08:692 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://mongo1:27017,mongo2:27018,mongo3:27019,mongo4:27020,mongo5:27021/?replicaSet=rs0
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2025-11-22 16:36:17:662 9 sec: 1000 operations; 111.1 current ops/sec; [CLEANUP: Count=1, Max=5759, Min=5756, Avg=5758, 90=5759, 99=5759, 99.9=5759, 99.99=5759] [INSERT: Count=1000, Max=243199, Min=4004, Avg=8387.99, 90=11351, 99=19663, 99.9=89087, 99.99=243199] 
[OVERALL], RunTime(ms), 9001
[OVERALL], Throughput(ops/sec), 111.09876680368848
[TOTAL_GCS_G1_Young_Generation], Count, 14
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 68
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7554716142650817
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 14
[TOTAL_GC_TIME], Time(ms), 68
[TOTAL_GC_TIME_%], Time(%), 0.7554716142650817
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5758.0
[CLEANUP], MinLatency(us), 5756
[CLEANUP], MaxLatency(us), 5759
[CLEANUP], 95thPercentileLatency(us), 5759
[CLEANUP], 99thPercentileLatency(us), 5759
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 8387.987
[INSERT], MinLatency(us), 4004
[INSERT], MaxLatency(us), 243199
[INSERT], 95thPercentileLatency(us), 13319
[INSERT], 99thPercentileLatency(us), 19663
[INSERT], Return=OK, 1000