results_mongo_5/workloada_5nodes_run_3.txt
java -cp /mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/conf:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/conf:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/core-0.17.0.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P ../workloads/workloada -P mongodb.properties -t
Command line: -db site.ycsb.db.MongoDbClient -s -P ../workloads/workloada -P mongodb.properties -t
YCSB Client 0.17.0

Loading workload...
Starting test.
2025-11-22 16:34:48:227 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://mongo1:27017,mongo2:27018,mongo3:27019,mongo4:27020,mongo5:27021/?replicaSet=rs0
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2025-11-22 16:34:53:555 5 sec: 1000 operations; 186.67 current ops/sec; [READ: Count=476, Max=46495, Min=651, Avg=1701.82, 90=3109, 99=7279, 99.9=46495, 99.99=46495] [CLEANUP: Count=1, Max=5307, Min=5304, Avg=5306, 90=5307, 99=5307, 99.9=5307, 99.99=5307] [UPDATE: Count=524, Max=192511, Min=4176, Avg=7453.61, 90=9799, 99=14215, 99.9=15687, 99.99=192511] 
[OVERALL], RunTime(ms), 5357
[OVERALL], Throughput(ops/sec), 186.67164457718872
[TOTAL_GCS_G1_Young_Generation], Count, 6
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 29
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5413477692738473
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 6
[TOTAL_GC_TIME], Time(ms), 29
[TOTAL_GC_TIME_%], Time(%), 0.5413477692738473
[READ], Operations, 476
[READ], AverageLatency(us), 1701.8172268907563
[READ], MinLatency(us), 651
[READ], MaxLatency(us), 46495
[READ], 95thPercentileLatency(us), 4191
[READ], 99thPercentileLatency(us), 7279
[READ], Return=OK, 476
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5306.0
[CLEANUP], MinLatency(us), 5304
[CLEANUP], MaxLatency(us), 5307
[CLEANUP], 95thPercentileLatency(us), 5307
[CLEANUP], 99thPercentileLatency(us), 5307
[UPDATE], Operations, 524
[UPDATE], AverageLatency(us), 7453.6106870229005
[UPDATE], MinLatency(us), 4176
[UPDATE], MaxLatency(us), 192511
[UPDATE], 95thPercentileLatency(us), 11087
[UPDATE], 99thPercentileLatency(us), 14215
[UPDATE], Return=OK, 524